#include <stdio.h>
#include <iostream>

void task_1();
void task_2();
void task_3();
void task_4();
void task_5();
void task_6();
void task_7();
void task_8();
void task_9();
void task_10();

int main()
{
    setlocale(LC_ALL, "RU");
    //************************* Для проверки раскомментировать проверяюмую функцию **********

    //task_1();
    //task_2();
    //task_3();
    //task_4();
    //task_5();
    //task_6();
    //task_7();
    //task_8();
    //task_9();
    //task_10();

}

void task_1()
{    
    char ansfer;
    printf("Уроки сделаны?\n");
    scanf_s("%c", &ansfer);
    if (ansfer == 'y')                          // Проверяем введенный символ
    {
        printf("Молодец!");
    }
    
}
//*********************************************************************************

void task_2()
    {
        int number_task_2;
        printf("Введите число: ");
        scanf_s("%d", &number_task_2);
        if (number_task_2 < 0)                   // Проверяем введенное число если меньше 0, отрицательное   
        {
            printf("Число: %d отрицательное.", number_task_2);
        }        
    }
//*********************************************************************************

void task_3()
    {
        int number_task_3;
        printf("Введите число: ");
        scanf_s("%d", &number_task_3);
        if (number_task_3 > 0)                    // Проверяем введенное число если больше 0, положительное
        {
            printf("Введенное число: %d четное. ", number_task_3);
        }
    }
//*********************************************************************************

void task_4()
    {
    int number_task_4;
    printf("Введите число: ");
    scanf_s("%d", &number_task_4);     
    if (number_task_4 % 10 == 5)                // Проверяем делением с остатком заканчивается ли число на 5
        printf("Число: %d заканчивается на 5.", number_task_4);
    }

//*********************************************************************************

void task_5()
{
    int number_task_5;
        printf("Введите число: ");
        scanf_s("%d", &number_task_5);
        if (number_task_5 % 2 == 0 && number_task_5 > 0)              // Проверяем делением на 2 что число четное и также положительное
        {
            printf("Число %d подходит", number_task_5);
        }
}

//*********************************************************************************

void task_6()
{
    int number_task_6;
    printf("Введите число: ");
    scanf_s("%d",&number_task_6);
    if (number_task_6 >= 10)                                           // Проверяем что больше 10
    {
        printf("Ты победил!");

    }
}

//*********************************************************************************

void task_7()
{
    int a, b, c;
    printf("Введите длину стороны а: ");
    scanf_s("%d", &a);
    printf("Введите длину стороны b: ");
    scanf_s("%d", &b);
    printf("Введите длину стороны с: ");
    scanf_s("%d", &c);
    if (a < (b + c)  &&  b < (a + c) && c < (a + b))                          // Проверяем что длина основания больше двух других сторон
    {
        printf("Треугольник существует.");
    }
}
//*********************************************************************************

void task_8() 
    {
        int x, y;
        printf("Введите координаты x: ");
        scanf_s("%d", &x);
        printf("Введите координаты y: ");
        scanf_s("%d", &y);
        if (x > 0 && y > 0)                                                  // Проверяем где находится точка
        {
            printf("Плоскость I");
        }
        if (x < 0 && y > 0)
        {
            printf("Плоскость II");
        }
        if (x < 0 && y < 0)
        {
            printf("Плоскость III");
        }
        if (x > 0 && y < 0)
        {
            printf("Плоскость IV");
        }
    }
    
//*********************************************************************************
void task_9()
{
    int number_task_9_1, number_task_9_2;
    printf("Введите первое число: ");
    scanf_s("%d", &number_task_9_1);
    printf("Введите второе число: ");
    scanf_s("%d", &number_task_9_2);
    if (number_task_9_1 > number_task_9_2)                                    // Проверяем что делитель меньше делимого
    {
        printf("%d  делится на %d", number_task_9_1, number_task_9_2);
    }
}


//*********************************************************************************

void task_10()
{
    int number_task_10, r;
    printf("Введите трех значное число: ");
    scanf_s("%d", &number_task_10);
    r = (number_task_10 % 10) + (number_task_10 / 10 % 10) + (number_task_10 / 100 % 10);     // Складываем остаток от деления единицы, десятки, сотни.
    if (r > 9)
    {
        printf("Сумма цифр %d: ", r);
    }
}













